app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "fjborie@miuandes.cl"], ["LIMIT", 1]]
---
	def create
		#complete this method
    user = User.find_by(email: create_params[:email])