app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #complete this method
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone", "1234567890"], ["updated_at", "2018-04-17 17:17:18.407720"], ["id", 5]]
---
  def update
    #complete this method
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)